{
    "data": [
        {
            "title": "Oracle's Opera Cloud",
            "role": "Framework developer, Full stack application engineer, Intern team lead.",
            "start": "September 2023",
            "end": "Present",
            "description": "A comprehensive cloud-based property management system (PMS) designed specifically for the hospitality industry, allowing them to manage reservations, guest profiles, room inventory, sales, and other operations centrally within a single platform; some notable clients include Hyatt, Crown Resorts, Minor Hotel Group, Premier Inn Hotels Limited, and various other large hotel chains across the globe. ",
            "technologies": [
                "react",
                "typescript",
                "node",
                "cypress",
                "git",
                "java",
                "html"
            ],
            "projectImages": [
                "project11.webp",
                "project12.webp"
            ],
            "url": "https://www.oracle.com/in/hospitality/hotel-property-management/hotel-pms-software/tour/"
        },
        {
            "title": "Aether",
            "role": "Frontend Engineer & Designer",
            "start": "October 2022",
            "end": "December 2022",
            "description": "Aether is a modular, visually-driven self-exploration and productivity platform built with Next.js, React, and Firebase, featuring a highly interactive canvas using React Flow. It allows users to create, organize, and connect life elements like passions, goals, and dreams through nodes and timelines. It uses Supabase storage for decentralized image storage and offers seamless dark/light theming, SCSS-based responsive styling, and a scalable component architecture. Designed for extensibility and clean state management, Aether integrates journaling, goal tracking, and visualization into a unified, personalized experience.",
            "technologies": [
                "react",
                "typescript",
                "figma",
                "firebase",
                "supabase"
            ],
            "projectImages": [
                "project61.webp",
                "project62.webp",
                "project63.webp"
            ],
            "url": "https://contra.com/p/NUoYZ2BM-aether"
        },
        {
            "title": "Policy Compliance System",
            "role": "Full Stack Developer",
            "start": "January 2023",
            "end": "March 2023",
            "description": "Developed a secure, SOC 2-compliant web application to streamline how organizations manage and track employee policy acknowledgments. The system automates the entire workflow—from role-based policy assignment and version control to approval tracking and smart escalation handling—ensuring zero compliance gaps. Designed with enterprise scalability in mind, it empowers HR and legal teams to maintain audit readiness effortlessly while reducing manual overhead.",
            "technologies": [
                "react",
                "typescript",
                "node",
                "postgresql",
                "firebase"
            ],
            "projectImages": [
                "project51.webp",
                "project52.webp",
                "project53.webp",
                "project54.webp",
                "project55.webp",
                "project56.webp",
                "project57.webp",
                "project58.webp",
                "project59.webp"
            ],
            "url": "https://docs.google.com/document/d/1UgFN7qpVdGrDzPuNyUg97LLtxXgkvLk8vITuKfN3IxM/edit?usp=sharing"
        },
        {
            "title": "Vortex AI",
            "role": "AI/ML Engineer, Full Stack Developer",
            "start": "February 2024",
            "end": "Present",
            "description": "Engineered a cutting-edge document intelligence platform that converts PDFs into searchable, interactive knowledge bases using LangChain, OpenAI's GPT-4, and FAISS. Admins can upload internal documentation, which the system intelligently indexes and understands, enabling users to query the content through a conversational AI chatbot. It’s a next-gen solution for organizations to unlock insights from static files with real-time, contextual answers—redefining how teams access critical information.",
            "technologies": [
                "langchain",
                "gpt4",
                "fastapi",
                "react",
                "typescript",
                "node",
                "ai"
            ],
            "projectImages": [
                "project71.webp"
            ],
            "url": "https://github.com/karthikeyan2601/Vortex-AI"
        },
        {
            "title": "Order Management System",
            "role": "Full stack developer, UI/UX Designer",
            "start": "February 2019",
            "end": "June 2019",
            "description": "Created an order and stock management web application for a construction company, featuring four distinct user roles with tailored pages to support their specific functionalities. The system provides a comprehensive set of features for efficient order tracking, inventory management, and reporting. Delivered a high-performance, full-stack website.",
            "technologies": [
                "react",
                "typescript",
                "node",
                "git",
                "postgresql",
                "expressjs"
            ],
            "projectImages": [
                "project21.webp",
                "project22.webp",
                "project23.webp",
                "project24.webp",
                "project25.webp"
            ],
            "url": "https://contra.com/p/7g2mWsbR-order-management-system"
        },
        {
            "title": "Safe Video Kit - Secure and Seamless Video Editing and Sharing",
            "role": "Full stack developer, UI/UX Designer",
            "start": "March 2021",
            "end": "April 2021",
            "description": "Safe Video Kit is a cutting-edge web application designed to provide secure and seamless video editing and sharing capabilities. With a strong focus on data security, Safe Video Kit ensures that your videos are protected while offering a seamless editing experience. Unlock new possibilities and unleash your creativity without compromising on the privacy of your valuable video content.",
            "technologies": [
                "html",
                "css",
                "javascript",
                "jekyll"
            ],
            "projectImages": [
                "project31.webp",
                "project32.webp",
                "project33.webp"
            ],
            "url": "https://contra.com/p/AEMYlRUU-safe-video-kit-secure-and-seamless-video-editing-and-sharing"
        },
        {
            "title": "Student Profile Management System",
            "role": "Full stack developer, UI/UX Designer",
            "start": "July 2020",
            "end": "December 2020",
            "description": "The Student Profile Management System is a web application that simplifies student information management for educational institutions. It provides secure login, student registration, course management, attendance tracking, grade management, communication, and data export/import features.",
            "technologies": [
                "react",
                "javascript",
                "springboot",
                "java",
                "firebase"
            ],
            "projectImages": [
                "project41.webp",
                "project42.webp",
                "project43.webp",
                "project44.webp",
                "project45.webp"
            ],
            "url": "https://contra.com/p/kFPAbeZN-student-profile-management-system"
        }
    ]
}